GeehySemi/APM32F4xx_SDK/Utilities/SVD/APM32F427.svd
                <register>
                    <name>WRTTIM2</name>
                    <displayName>WRTTIM2</displayName>
                    <description>SRAM/NOR-Flash write timing registers 2</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0FFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ASYNCACCCFG</name>
                            <description>Asynchronous Access Mode Configure</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DATLATCFG</name>
                            <description>Data latency Configure</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CLKDIVCFG</name>
                            <description>Clock divide ratio (for CLK signal Configure</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BUSTURNCFG</name>
                            <description>Bus Turnaround Phase Duration Configure</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DATASETCFG</name>
                            <description>Data-Setup Time Configure</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>ADDRHLDCFG</name>
                            <description>Address-Hold Time Configure</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADDRSETCFG</name>
                            <description>Address Setup Time Configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WRTTIM3</name>
                    <displayName>WRTTIM3</displayName>
                    <description>SRAM/NOR-Flash write timing registers 3</description>
                    <addressOffset>0x114</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0FFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ASYNCACCCFG</name>
                            <description>Asynchronous Access Mode Configure</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DATLATCFG</name>
                            <description>Data latency Configure</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CLKDIVCFG</name>
                            <description>Clock divide ratio (for CLK signal Configure</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BUSTURNCFG</name>
                            <description>Bus Turnaround Phase Duration Configure</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DATASETCFG</name>
                            <description>Data-Setup Time Configure</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>ADDRHLDCFG</name>
                            <description>Address-Hold Time Configure</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADDRSETCFG</name>
                            <description>Address Setup Time Configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WRTTIM4</name>
                    <displayName>WRTTIM4</displayName>
                    <description>SRAM/NOR-Flash write timing registers 4</description>
                    <addressOffset>0x11C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0FFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ASYNCACCCFG</name>
                            <description>Asynchronous Access Mode Configure</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DATLATCFG</name>
                            <description>Data latency Configure</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CLKDIVCFG</name>
                            <description>Clock divide ratio (for CLK signal Configure</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BUSTURNCFG</name>
                            <description>Bus Turnaround Phase Duration Configure</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DATASETCFG</name>
                            <description>Data-Setup Time Configure</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>ADDRHLDCFG</name>
                            <description>Address-Hold Time Configure</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADDRSETCFG</name>
                            <description>Address Setup Time Configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
