GeehySemi/APM32F4xx_SDK/Utilities/SVD/APM32F427.svd
                <register>
                    <name>GCINT</name>
                    <displayName>GCINT</displayName>
                    <description>OTG_FS core interrupt register
          (OTG_FS_GINTSTS)</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x04000020</resetValue>
                    <fields>
                        <field>
                            <name>CURMOSEL</name>
                            <description>Current mode of operation</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MMIS</name>
                            <description>Mode mismatch interrupt</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OTG</name>
                            <description>OTG interrupt</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SOF</name>
                            <description>Start of frame</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXFNONE</name>
                            <description>RxFIFO non-empty</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NPTXFEM</name>
                            <description>Non-periodic TxFIFO empty</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GINNPNAKE</name>
                            <description>Global IN non-periodic NAK
              effective</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GONAKE</name>
                            <description>Global OUT NAK effective</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ESUS</name>
                            <description>Early suspend</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBSUS</name>
                            <description>USB suspend</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBRST</name>
                            <description>USB reset</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENUMD</name>
                            <description>Enumeration done</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ISOPD</name>
                            <description>Isochronous OUT packet dropped
              interrupt</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPF</name>
                            <description>End of periodic frame
              interrupt</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEP</name>
                            <description>IN endpoint interrupt</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ONEP</name>
                            <description>OUT endpoint interrupt</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IIINTX</name>
                            <description>Incomplete isochronous IN
              transfer</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IP_OUTTX</name>
                            <description>Incomplete periodic transfer(Host
              mode)/Incomplete isochronous OUT transfer(Device
              mode)</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HPORT</name>
                            <description>Host port interrupt</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HCHAN</name>
                            <description>Host channels interrupt</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PTXFE</name>
                            <description>Periodic TxFIFO empty</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CINSTSCHG</name>
                            <description>Connector ID status change</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEDIS</name>
                            <description>Disconnect detected
              interrupt</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SREQ</name>
                            <description>Session request/new session detected
              interrupt</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RWAKE</name>
                            <description>Resume/remote wakeup detected
              interrupt</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GINTMASK</name>
                    <displayName>GINTMASK</displayName>
                    <description>OTG_FS interrupt mask register
          (OTG_FS_GINTMSK)</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MMISM</name>
                            <description>Mode mismatch interrupt
              mask</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OTGM</name>
                            <description>OTG interrupt mask</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SOFM</name>
                            <description>Start of frame mask</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXFNONEM</name>
                            <description>Receive FIFO non-empty
              mask</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NPTXFEMM</name>
                            <description>Non-periodic TxFIFO empty
              mask</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GINNPNAKEM</name>
                            <description>Global non-periodic IN NAK effective
              mask</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GONAKEM</name>
                            <description>Global OUT NAK effective
              mask</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ESUSM</name>
                            <description>Early suspend mask</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBSUSM</name>
                            <description>USB suspend mask</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBRSTM</name>
                            <description>USB reset mask</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENUMDM</name>
                            <description>Enumeration done mask</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ISOPDM</name>
                            <description>Isochronous OUT packet dropped interrupt
              mask</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPFM</name>
                            <description>End of periodic frame interrupt
              mask</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPMISM</name>
                            <description>Endpoint mismatch interrupt
              mask</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPM</name>
                            <description>IN endpoints interrupt
              mask</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTEPM</name>
                            <description>OUT endpoints interrupt
              mask</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IIINTXM</name>
                            <description>Incomplete isochronous IN transfer
              mask</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IP_OUTTXM</name>
                            <description>Incomplete periodic transfer mask(Host
              mode)/Incomplete isochronous OUT transfer mask(Device
              mode)</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HPORTM</name>
                            <description>Host port interrupt mask</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HCHM</name>
                            <description>Host channels interrupt
              mask</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PTXFEM</name>
                            <description>Periodic TxFIFO empty mask</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CIDSTSTCM</name>
                            <description>Connector ID status change
              mask</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEDISM</name>
                            <description>Disconnect detected interrupt
              mask</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SREQM</name>
                            <description>Session request/new session detected
              interrupt mask</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RWAKEM</name>
                            <description>Resume/remote wakeup detected interrupt
              mask</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GRXSTS</name>
                    <displayName>GRXSTS</displayName>
                    <description>OTG_FS Receive status debug read(Device
          mode)</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EPNUM</name>
                            <description>Endpoint number</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BCNT</name>
                            <description>Byte count</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>Data PID</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PSTS</name>
                            <description>Packet status</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>FNUM</name>
                            <description>Frame number</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GRXSTSP</name>
                    <displayName>GRXSTSP</displayName>
                    <description>OTG_FS Receive status debug read(Host
          mode)</description>
                    <alternateRegister>GRXSTS</alternateRegister>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CHNUM</name>
                            <description>Endpoint number</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BCNT</name>
                            <description>Byte count</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>Data PID</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PSTS</name>
                            <description>Packet status</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
