GeehySemi/APM32F4xx_SDK/Utilities/SVD/APM32F427.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>OTG_FS2_DEVICE</name>
            <description>USB on the go full speed</description>
            <groupName>USB_OTG_FS</groupName>
            <baseAddress>0x40040800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>DCFG</name>
                    <displayName>DCFG</displayName>
                    <description>OTG_FS device configuration register (OTG_FS_DCFG)</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x02200000</resetValue>
                    <fields>
                        <field>
                            <name>DSPDSEL</name>
                            <description>Device speed</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SENDOUT</name>
                            <description>Non-zero-length status OUT
              handshake</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DADDR</name>
                            <description>Device address</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>PFITV</name>
                            <description>Periodic frame interval</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DCTRL</name>
                    <displayName>DCTRL</displayName>
                    <description>OTG_FS device control register (OTG_FS_DCTL)</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RWKUPS</name>
                            <description>Remote wakeup signaling</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SDCNNT</name>
                            <description>Soft disconnect</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GINAKSTS</name>
                            <description>Global IN NAK status</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GONAKSTS</name>
                            <description>Global OUT NAK status</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TESTSEL</name>
                            <description>Test control</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GINAKSET</name>
                            <description>Set global IN NAK</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GINAKCLR</name>
                            <description>Clear global IN NAK</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GONAKSET</name>
                            <description>Set global OUT NAK</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GONAKCLR</name>
                            <description>Clear global OUT NAK</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POPROGCMP</name>
                            <description>Power-on programming done</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DSTS</name>
                    <displayName>DSTS</displayName>
                    <description>OTG_FS device status register (OTG_FS_DSTS)</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000010</resetValue>
                    <fields>
                        <field>
                            <name>SUSSTS</name>
                            <description>Suspend status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ENUMSPD</name>
                            <description>Enumerated speed</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ERTERR</name>
                            <description>Erratic error</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SOFNUM</name>
                            <description>Frame number of the received
              SOF</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DINIMASK</name>
                    <displayName>DINIMASK</displayName>
                    <description>OTG_FS device IN endpoint common interrupt mask register (OTG_FS_DIEPMSK)</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSFCMPM</name>
                            <description>Transfer completed interrupt
              mask</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPDISM</name>
                            <description>Endpoint disabled interrupt
              mask</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TOM</name>
                            <description>Timeout condition mask (Non-isochronous
              endpoints)</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ITXEMPM</name>
                            <description>IN token received when TxFIFO empty
              mask</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IEPMMM</name>
                            <description>IN token received with EP mismatch
              mask</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IEPNAKEM</name>
                            <description>IN endpoint NAK effective
              mask</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOUTIMASK</name>
                    <displayName>DOUTIMASK</displayName>
                    <description>OTG_FS device OUT endpoint common interrupt mask register (OTG_FS_DOEPMSK)</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSFCMPM</name>
                            <description>Transfer completed interrupt
              mask</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPDISM</name>
                            <description>Endpoint disabled interrupt
              mask</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SETPCMPM</name>
                            <description>SETUP phase done mask</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OTXEMPM</name>
                            <description>OUT token received when endpoint
              disabled mask</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAEPINT</name>
                    <displayName>DAEPINT</displayName>
                    <description>OTG_FS device all endpoints interrupt
          register (OTG_FS_DAINT)</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INEPINT</name>
                            <description>IN endpoint interrupt bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>OUTEPINT</name>
                            <description>OUT endpoint interrupt
              bits</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAEPIMASK</name>
                    <displayName>DAEPIMASK</displayName>
                    <description>OTG_FS all endpoints interrupt mask register
          (OTG_FS_DAINTMSK)</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>AINM</name>
                            <description>IN EP interrupt mask bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>AOUTM</name>
                            <description>OUT endpoint interrupt
              bits</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DVBUSDTIM</name>
                    <displayName>DVBUSDTIM</displayName>
                    <description>OTG_FS device VBUS discharge time
          register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x000017D7</resetValue>
                    <fields>
                        <field>
                            <name>VBUSDTIM</name>
                            <description>Device VBUS discharge time</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DVBUSPTIM</name>
                    <displayName>DVBUSPTIM</displayName>
                    <description>OTG_FS device VBUS pulsing time
          register</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x000005B8</resetValue>
                    <fields>
                        <field>
                            <name>VBUSPTIM</name>
                            <description>Device VBUS pulsing time</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEIMASK</name>
                    <displayName>DIEIMASK</displayName>
                    <description>OTG_FS device IN endpoint FIFO empty
          interrupt mask register</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INEM</name>
                            <description>IN EP Tx FIFO empty interrupt mask
              bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPCTRL0</name>
                    <displayName>DIEPCTRL0</displayName>
                    <description>OTG_FS device control IN endpoint 0 control
          register (OTG_FS_DIEPCTL0)</description>
                    <addressOffset>0x100</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MAXPS</name>
                            <description>Maximum packet size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBAEP</name>
                            <description>USB active endpoint</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NAKSTSTCFG</name>
                            <description>NAK status</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EPTYPE</name>
                            <description>Endpoint type</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STALLH</name>
                            <description>STALL handshake</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFNUM</name>
                            <description>TxFIFO number</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAKCLR</name>
                            <description>Clear NAK</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>NAKSET</name>
                            <description>Set NAK</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint disable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EPEN</name>
                            <description>Endpoint enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
